zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms64k_56_qfn.h
    /* P0.2 */
    P0_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_2_MSC0_SENSE                 =  4,       /* msc[0].sense:29 */
    P0_2_MSC0_SHIELD                =  5,       /* msc[0].shield:29 */
    P0_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_2_TCPWM_TR_IN3               =  8,       /* Digital Active - tcpwm.tr_in[3] */
    P0_2_LIN_LIN_EN0                =  9,       /* Digital Active - lin.lin_en[0]:0 */
    P0_2_SCB0_UART_RTS              = 10,       /* Digital Active - scb[0].uart_rts:0 */
    P0_2_TCPWM_LINE1                = 11,       /* Digital Active - tcpwm.line[1]:0 */
    P0_2_SCB0_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[0].spi_miso:0 */
    P0_2_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:1 */

    /* P0.3 */
    P0_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_3_MSC0_SENSE                 =  4,       /* msc[0].sense:28 */
    P0_3_MSC0_SHIELD                =  5,       /* msc[0].shield:28 */
    P0_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_3_TCPWM_TR_IN2               =  8,       /* Digital Active - tcpwm.tr_in[2] */
    P0_3_SCB0_UART_CTS              = 10,       /* Digital Active - scb[0].uart_cts:0 */
    P0_3_TCPWM_LINE_COMPL1          = 11,       /* Digital Active - tcpwm.line_compl[1]:0 */
    P0_3_SCB0_SPI_SELECT0           = 12,       /* Digital Deep Sleep - scb[0].spi_select0 */
    P0_3_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:1 */

    /* P0.4 */
    P0_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_4_MSC0_SENSE                 =  4,       /* msc[0].sense:27 */
    P0_4_MSC0_SHIELD                =  5,       /* msc[0].shield:27 */
    P0_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_4_TCPWM_TR_IN1               =  8,       /* Digital Active - tcpwm.tr_in[1] */
    P0_4_PASS0_DSI_SAR_DATA10       = 10,       /* Digital Active - pass[0].dsi_sar_data[10] */
    P0_4_TCPWM_LINE2                = 11,       /* Digital Active - tcpwm.line[2]:0 */
    P0_4_SCB0_SPI_SELECT1           = 12,       /* Digital Deep Sleep - scb[0].spi_select1 */

    /* P0.5 */
    P0_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_5_MSC0_SENSE                 =  4,       /* msc[0].sense:26 */
    P0_5_MSC0_SHIELD                =  5,       /* msc[0].shield:26 */
    P0_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_5_TCPWM_TR_IN0               =  8,       /* Digital Active - tcpwm.tr_in[0] */
    P0_5_PASS0_DSI_SAR_DATA9        = 10,       /* Digital Active - pass[0].dsi_sar_data[9] */
    P0_5_TCPWM_LINE_COMPL2          = 11,       /* Digital Active - tcpwm.line_compl[2]:0 */
    P0_5_SCB0_SPI_SELECT2           = 12,       /* Digital Deep Sleep - scb[0].spi_select2 */

    /* P0.6 */
    P0_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_6_MSC0_SENSE                 =  4,       /* msc[0].sense:25 */
    P0_6_MSC0_SHIELD                =  5,       /* msc[0].shield:25 */
    P0_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_6_PASS0_DSI_SAR_DATA8        = 10,       /* Digital Active - pass[0].dsi_sar_data[8] */
    P0_6_TCPWM_LINE0                = 11,       /* Digital Active - tcpwm.line[0]:3 */
    P0_6_SCB0_SPI_SELECT3           = 12,       /* Digital Deep Sleep - scb[0].spi_select3 */

    /* P0.7 */
    P0_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P0_7_MSC0_SENSE                 =  4,       /* msc[0].sense:24 */
    P0_7_MSC0_SHIELD                =  5,       /* msc[0].shield:24 */
    P0_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P0_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P0_7_PASS0_DSI_SAR_DATA7        = 10,       /* Digital Active - pass[0].dsi_sar_data[7] */
    P0_7_TCPWM_LINE_COMPL0          = 11,       /* Digital Active - tcpwm.line_compl[0]:3 */
    P0_7_SCB1_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[1].spi_clk:1 */

    /* P1.0 */
    P1_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_0_MSC0_SENSE                 =  4,       /* msc[0].sense:10 */
    P1_0_MSC0_SHIELD                =  5,       /* msc[0].shield:10 */
    P1_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_0_CXPI_CXPI_EN0              =  8,       /* Digital Active - cxpi.cxpi_en[0]:1 */
    P1_0_HVSS_LIN_ALT_EN            =  9,       /* Digital Active - hvss.lin_alt_en */
    P1_0_SCB1_UART_CTS              = 10,       /* Digital Active - scb[1].uart_cts:1 */
    P1_0_TCPWM_LINE2                = 11,       /* Digital Active - tcpwm.line[2]:2 */
    P1_0_CPUSS_FAULT_OUT0           = 14,       /* Digital Deep Sleep - cpuss.fault_out[0] */

    /* P1.1 */
    P1_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_1_MSC0_SENSE                 =  4,       /* msc[0].sense:11 */
    P1_1_MSC0_SHIELD                =  5,       /* msc[0].shield:11 */
    P1_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_1_MSC0_EXT_SYNC              =  8,       /* Digital Active - msc[0].ext_sync */
    P1_1_HVSS_LIN_ALT_TXD           =  9,       /* Digital Active - hvss.lin_alt_txd */
    P1_1_SCB1_UART_RTS              = 10,       /* Digital Active - scb[1].uart_rts:1 */
    P1_1_TCPWM_LINE_COMPL3          = 11,       /* Digital Active - tcpwm.line_compl[3]:2 */
    P1_1_SCB1_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[1].spi_clk:0 */
    P1_1_CPUSS_FAULT_OUT1           = 14,       /* Digital Deep Sleep - cpuss.fault_out[1] */

    /* P1.2 */
    P1_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_2_MSC0_SENSE                 =  4,       /* msc[0].sense:12 */
    P1_2_MSC0_SHIELD                =  5,       /* msc[0].shield:12 */
    P1_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_2_MSC0_EXT_SYNC_CLK          =  8,       /* Digital Active - msc[0].ext_sync_clk */
    P1_2_HVSS_LIN_ALT_RXD           =  9,       /* Digital Active - hvss.lin_alt_rxd */
    P1_2_SCB1_UART_TX               = 10,       /* Digital Active - scb[1].uart_tx:0 */
    P1_2_TCPWM_LINE3                = 11,       /* Digital Active - tcpwm.line[3]:2 */
    P1_2_SCB1_SPI_SELECT1           = 12,       /* Digital Deep Sleep - scb[1].spi_select1 */
    P1_2_SCB1_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[1].i2c_sda:0 */

